## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_secret.zerossl-eab-hmac-key must be replaced
-/+ resource "kubernetes_secret" "zerossl-eab-hmac-key" {
!       id        = "kube-system/zerossl-hmac-key" -> (known after apply)
-       immutable = false -> null
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
!           name             = "zerossl-hmac-key" -> "zerossl-eab-hmac-key" # forces replacement
!           resource_version = "11152" -> (known after apply)
!           uid              = "d352490b-b13f-41e9-a913-a50e91355210" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key-id must be replaced
-/+ resource "kubernetes_secret" "zerossl-eab-hmac-key-id" {
!       id        = "kube-system/zerossl-hmac-key-id" -> (known after apply)
-       immutable = false -> null
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
!           name             = "zerossl-hmac-key-id" -> "zerossl-eab-hmac-key-id" # forces replacement
!           resource_version = "11153" -> (known after apply)
!           uid              = "87445c5f-2d31-4e84-bacc-01200110671b" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
